import React from 'react'
import "./Introduction.scss"

const Introduction = () => {
  return (
    <section id="intro" className="intro">
      <div className="inner">
        {/* <p>
          "새로운 기술을 배우고 직접 구현해보는 과정을 좋아합니다. <br/> 작은 시도라도 결과로 이어질 때, 그 과정에서 배우는 즐거움을 느낍니다. <br/> 기능을 만드는 데서 멈추지 않고, 더 나은 코드를 고민하며 한 단계씩 성장하고 있습니다."
        </p> */}
        <p>하늘은 늘 같은 자리에 있지만,<br/> 그 안에서는 수많은 변화가 일어납니다. <br/> 저 역시 그런 하늘처럼 변화를 두려워하지 않고,<br/> 성장하는 프론트엔드 개발자 이하늘입니다.</p>
        
        {/* <p>하늘은 늘 같은 자리에 있지만,<br/> 그 안에서는 수많은 변화가 일어납니다. <br/> 저도 그런 하늘처럼,<br/> 변화를 두려워하지 않고 성장하는 프론트엔드 개발자 이하늘입니다.</p> */}
        
        {/* 변화 속에서도 꾸준히 배우며 성장하는 프론트엔드 개발자 이하늘입니다. */}

        {/* <p>개발을 공부하면서 가장 재미있는 순간은  <br/> 배운 지식이 화면 위에서 ‘결과물’로 나타날 때입니다. <br/> 그 과정이 어렵더라도, 매번 새로운 시도를 하며 조금씩 더 나아지는 제 자신을 발견하는 게 즐겁습니다.  <br/> 꾸준히 배우고 시도하는 개발자, 그런 마음으로 성장해가고 있습니다.</p> */}
      </div>
    </section>
  )
}

export default Introduction

// 🌤 Introduce

//  하늘은 늘 같은 자리에 있지만,  
//     그 안에서는 수많은 변화가 일어납니다.  
//     저 역시 그런 하늘처럼 배우며 성장하고 싶습니다.

// 하늘은 늘 같은 자리에 있지만,
// 그 안에서는 매일 조금씩 변화가 일어납니다.

// 저도 그런 하늘처럼,
// 익숙함에 머무르기보다 배우며 나아가는 개발자가 되고 싶습니다.
// 변화 속에서도 꾸준히 성장하며
// 오늘보다 나은 내일을 만들기 위해 노력합니다.

// ☁️ About

// 프론트엔드 개발자 이하늘입니다.
// 경영학 전공을 바탕으로 사용자와 서비스의 흐름을 이해하고,
// 기술로 그 연결을 구체화하는 과정을 즐깁니다.

// 화면을 단순히 ‘보이는 것’으로 끝내지 않고,
// 사용자가 자연스럽게 느끼는 ‘경험’으로 만드는 걸 목표로 합니다.

// 꾸준히 배우며 개선하고,
// 더 나은 결과를 만드는 과정에서 성장의 의미를 찾습니다.